rt/ws/security/src/test/resources/org/apache/cxf/ws/security/wss4j/wsse-response-fault.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><s:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" s:mustUnderstand="true"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-94f8e6f3-2aca-42b4-8b7c-708cba43ec52"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=myAlias</ds:X509IssuerName><ds:X509SerialNumber>1181668586</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>AuYaQYEBTTTZojvmDCIXwrxB32HYooiXzJO6klKsNtqJ0C7MQIvkzvGpyqy266sSyKAAifDA1kx5rUP0y574CWOcWhbrD0OlQzvCmFvDwkAKea5tbCc1WeLNmN48KHv0OLRi2AKaWAcTkhAb0IzU1Dw7n7hrWz2Op+lNSp0xdU0=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-facc107a-9306-4081-873e-20110577c13c"/></xenc:ReferenceList></xenc:EncryptedKey><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-bd8fa67d-2c97-4a21-b5af-3b82795a26ff"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="s xsd xsi"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-2168e513-ba4c-413e-a765-9400f67b0b90"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd xsi"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>0Il0KUXoOUSLWESWGEv/WxIMZVM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>JEVxpip0nlvGlfMpXDU2lkrALdEvgNDVlyCtj4UxwN20B3rOP6Si8J5MO4Q9uHFq1+Olkl0qVp9VsldD/DppbA5Ghl30WYYupe/qyyN5lrSk6HYVe+3MwGkP8uRNZS8lW2JG+MssUvuDbLtIo8hwJw+iQhH/bY6Ffy1xjR+lVrQ=</ds:SignatureValue><ds:KeyInfo Id="KI-fcd5d6b1-1c7d-4121-8f84-bc1450387bb5"><wsse:SecurityTokenReference wsu:Id="STR-5dfa2eaf-5327-4ef7-a26f-d911a4c41f23" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=myAlias</ds:X509IssuerName><ds:X509SerialNumber>1181668586</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></s:Header><s:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2168e513-ba4c-413e-a765-9400f67b0b90"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-facc107a-9306-4081-873e-20110577c13c" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-94f8e6f3-2aca-42b4-8b7c-708cba43ec52"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>9aLrBzw1l/Re54FsBK4UusyzwA0zllEGWvTASH4OE65JK1/9vmEYayJx6Okg5QMo2bSa+rTLIjr4dxe/r5XWw/qD6mrAh4tooFgaPynx7O3htfvoujI1DbqaT1XbfiG/IR0z71Lu4za0xbDc7+t6YeGV+HehIP1psneYxZbcN/W1mhAL+gfnhXdfB+PNGZMivgy/LpqjJGtFmTpUHvk0IwNYzfyiNrE+sBYIZKJtsdI=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></s:Body></s:Envelope>